GopalSaraf/Practicals/PSDL/include/proc/pic18lf56k42.inc
// Register: CCDNC
#define CCDNC CCDNC
CCDNC                                    equ 03A69h
// bitfield definitions
CCDNC_CCDNC0_POSN                        equ 0000h
CCDNC_CCDNC0_POSITION                    equ 0000h
CCDNC_CCDNC0_SIZE                        equ 0001h
CCDNC_CCDNC0_LENGTH                      equ 0001h
CCDNC_CCDNC0_MASK                        equ 0001h
CCDNC_CCDNC1_POSN                        equ 0001h
CCDNC_CCDNC1_POSITION                    equ 0001h
CCDNC_CCDNC1_SIZE                        equ 0001h
CCDNC_CCDNC1_LENGTH                      equ 0001h
CCDNC_CCDNC1_MASK                        equ 0002h
CCDNC_CCDNC2_POSN                        equ 0002h
CCDNC_CCDNC2_POSITION                    equ 0002h
CCDNC_CCDNC2_SIZE                        equ 0001h
CCDNC_CCDNC2_LENGTH                      equ 0001h
CCDNC_CCDNC2_MASK                        equ 0004h
CCDNC_CCDNC3_POSN                        equ 0003h
CCDNC_CCDNC3_POSITION                    equ 0003h
CCDNC_CCDNC3_SIZE                        equ 0001h
CCDNC_CCDNC3_LENGTH                      equ 0001h
CCDNC_CCDNC3_MASK                        equ 0008h
CCDNC_CCDNC4_POSN                        equ 0004h
CCDNC_CCDNC4_POSITION                    equ 0004h
CCDNC_CCDNC4_SIZE                        equ 0001h
CCDNC_CCDNC4_LENGTH                      equ 0001h
CCDNC_CCDNC4_MASK                        equ 0010h
CCDNC_CCDNC5_POSN                        equ 0005h
CCDNC_CCDNC5_POSITION                    equ 0005h
CCDNC_CCDNC5_SIZE                        equ 0001h
CCDNC_CCDNC5_LENGTH                      equ 0001h
CCDNC_CCDNC5_MASK                        equ 0020h
CCDNC_CCDNC6_POSN                        equ 0006h
CCDNC_CCDNC6_POSITION                    equ 0006h
CCDNC_CCDNC6_SIZE                        equ 0001h
CCDNC_CCDNC6_LENGTH                      equ 0001h
CCDNC_CCDNC6_MASK                        equ 0040h
CCDNC_CCDNC7_POSN                        equ 0007h
CCDNC_CCDNC7_POSITION                    equ 0007h
CCDNC_CCDNC7_SIZE                        equ 0001h
CCDNC_CCDNC7_LENGTH                      equ 0001h
CCDNC_CCDNC7_MASK                        equ 0080h

// Register: RC3I2C
#define RC3I2C RC3I2C
RC3I2C                                   equ 03A6Ah
// bitfield definitions
RC3I2C_TH_POSN                           equ 0000h
RC3I2C_TH_POSITION                       equ 0000h
RC3I2C_TH_SIZE                           equ 0002h
RC3I2C_TH_LENGTH                         equ 0002h
RC3I2C_TH_MASK                           equ 0003h
RC3I2C_PU_POSN                           equ 0004h
RC3I2C_PU_POSITION                       equ 0004h
RC3I2C_PU_SIZE                           equ 0002h
RC3I2C_PU_LENGTH                         equ 0002h
RC3I2C_PU_MASK                           equ 0030h
RC3I2C_SLEW_POSN                         equ 0006h
RC3I2C_SLEW_POSITION                     equ 0006h
RC3I2C_SLEW_SIZE                         equ 0001h
RC3I2C_SLEW_LENGTH                       equ 0001h
RC3I2C_SLEW_MASK                         equ 0040h
RC3I2C_TH0_POSN                          equ 0000h
RC3I2C_TH0_POSITION                      equ 0000h
RC3I2C_TH0_SIZE                          equ 0001h
RC3I2C_TH0_LENGTH                        equ 0001h
RC3I2C_TH0_MASK                          equ 0001h
RC3I2C_TH1_POSN                          equ 0001h
RC3I2C_TH1_POSITION                      equ 0001h
RC3I2C_TH1_SIZE                          equ 0001h
RC3I2C_TH1_LENGTH                        equ 0001h
RC3I2C_TH1_MASK                          equ 0002h
RC3I2C_PU0_POSN                          equ 0004h
RC3I2C_PU0_POSITION                      equ 0004h
RC3I2C_PU0_SIZE                          equ 0001h
RC3I2C_PU0_LENGTH                        equ 0001h
RC3I2C_PU0_MASK                          equ 0010h
RC3I2C_PU1_POSN                          equ 0005h
RC3I2C_PU1_POSITION                      equ 0005h
RC3I2C_PU1_SIZE                          equ 0001h
RC3I2C_PU1_LENGTH                        equ 0001h
RC3I2C_PU1_MASK                          equ 0020h
RC3I2C_I2CTH_POSN                        equ 0000h
RC3I2C_I2CTH_POSITION                    equ 0000h
RC3I2C_I2CTH_SIZE                        equ 0002h
RC3I2C_I2CTH_LENGTH                      equ 0002h
RC3I2C_I2CTH_MASK                        equ 0003h
RC3I2C_I2CPU_POSN                        equ 0004h
RC3I2C_I2CPU_POSITION                    equ 0004h
RC3I2C_I2CPU_SIZE                        equ 0002h
RC3I2C_I2CPU_LENGTH                      equ 0002h
RC3I2C_I2CPU_MASK                        equ 0030h
RC3I2C_I2CSLEW_POSN                      equ 0006h
RC3I2C_I2CSLEW_POSITION                  equ 0006h
RC3I2C_I2CSLEW_SIZE                      equ 0001h
RC3I2C_I2CSLEW_LENGTH                    equ 0001h
RC3I2C_I2CSLEW_MASK                      equ 0040h
RC3I2C_I2CTH0_POSN                       equ 0000h
RC3I2C_I2CTH0_POSITION                   equ 0000h
RC3I2C_I2CTH0_SIZE                       equ 0001h
RC3I2C_I2CTH0_LENGTH                     equ 0001h
RC3I2C_I2CTH0_MASK                       equ 0001h
RC3I2C_I2CTH1_POSN                       equ 0001h
RC3I2C_I2CTH1_POSITION                   equ 0001h
RC3I2C_I2CTH1_SIZE                       equ 0001h
RC3I2C_I2CTH1_LENGTH                     equ 0001h
RC3I2C_I2CTH1_MASK                       equ 0002h
RC3I2C_I2CPU0_POSN                       equ 0004h
RC3I2C_I2CPU0_POSITION                   equ 0004h
RC3I2C_I2CPU0_SIZE                       equ 0001h
RC3I2C_I2CPU0_LENGTH                     equ 0001h
RC3I2C_I2CPU0_MASK                       equ 0010h
RC3I2C_I2CPU1_POSN                       equ 0005h
RC3I2C_I2CPU1_POSITION                   equ 0005h
RC3I2C_I2CPU1_SIZE                       equ 0001h
RC3I2C_I2CPU1_LENGTH                     equ 0001h
RC3I2C_I2CPU1_MASK                       equ 0020h

// Register: RC4I2C
#define RC4I2C RC4I2C
RC4I2C                                   equ 03A6Bh
// bitfield definitions
RC4I2C_TH_POSN                           equ 0000h
RC4I2C_TH_POSITION                       equ 0000h
RC4I2C_TH_SIZE                           equ 0002h
RC4I2C_TH_LENGTH                         equ 0002h
RC4I2C_TH_MASK                           equ 0003h
RC4I2C_PU_POSN                           equ 0004h
RC4I2C_PU_POSITION                       equ 0004h
RC4I2C_PU_SIZE                           equ 0002h
RC4I2C_PU_LENGTH                         equ 0002h
RC4I2C_PU_MASK                           equ 0030h
RC4I2C_SLEW_POSN                         equ 0006h
RC4I2C_SLEW_POSITION                     equ 0006h
RC4I2C_SLEW_SIZE                         equ 0001h
RC4I2C_SLEW_LENGTH                       equ 0001h
RC4I2C_SLEW_MASK                         equ 0040h
RC4I2C_TH0_POSN                          equ 0000h
RC4I2C_TH0_POSITION                      equ 0000h
RC4I2C_TH0_SIZE                          equ 0001h
RC4I2C_TH0_LENGTH                        equ 0001h
RC4I2C_TH0_MASK                          equ 0001h
RC4I2C_TH1_POSN                          equ 0001h
RC4I2C_TH1_POSITION                      equ 0001h
RC4I2C_TH1_SIZE                          equ 0001h
RC4I2C_TH1_LENGTH                        equ 0001h
RC4I2C_TH1_MASK                          equ 0002h
RC4I2C_PU0_POSN                          equ 0004h
RC4I2C_PU0_POSITION                      equ 0004h
RC4I2C_PU0_SIZE                          equ 0001h
RC4I2C_PU0_LENGTH                        equ 0001h
RC4I2C_PU0_MASK                          equ 0010h
RC4I2C_PU1_POSN                          equ 0005h
RC4I2C_PU1_POSITION                      equ 0005h
RC4I2C_PU1_SIZE                          equ 0001h
RC4I2C_PU1_LENGTH                        equ 0001h
RC4I2C_PU1_MASK                          equ 0020h
RC4I2C_I2CTH_POSN                        equ 0000h
RC4I2C_I2CTH_POSITION                    equ 0000h
RC4I2C_I2CTH_SIZE                        equ 0002h
RC4I2C_I2CTH_LENGTH                      equ 0002h
RC4I2C_I2CTH_MASK                        equ 0003h
RC4I2C_I2CPU_POSN                        equ 0004h
RC4I2C_I2CPU_POSITION                    equ 0004h
RC4I2C_I2CPU_SIZE                        equ 0002h
RC4I2C_I2CPU_LENGTH                      equ 0002h
RC4I2C_I2CPU_MASK                        equ 0030h
RC4I2C_I2CSLEW_POSN                      equ 0006h
RC4I2C_I2CSLEW_POSITION                  equ 0006h
RC4I2C_I2CSLEW_SIZE                      equ 0001h
RC4I2C_I2CSLEW_LENGTH                    equ 0001h
RC4I2C_I2CSLEW_MASK                      equ 0040h
RC4I2C_I2CTH0_POSN                       equ 0000h
RC4I2C_I2CTH0_POSITION                   equ 0000h
RC4I2C_I2CTH0_SIZE                       equ 0001h
RC4I2C_I2CTH0_LENGTH                     equ 0001h
RC4I2C_I2CTH0_MASK                       equ 0001h
RC4I2C_I2CTH1_POSN                       equ 0001h
RC4I2C_I2CTH1_POSITION                   equ 0001h
RC4I2C_I2CTH1_SIZE                       equ 0001h
RC4I2C_I2CTH1_LENGTH                     equ 0001h
RC4I2C_I2CTH1_MASK                       equ 0002h
RC4I2C_I2CPU0_POSN                       equ 0004h
RC4I2C_I2CPU0_POSITION                   equ 0004h
RC4I2C_I2CPU0_SIZE                       equ 0001h
RC4I2C_I2CPU0_LENGTH                     equ 0001h
RC4I2C_I2CPU0_MASK                       equ 0010h
RC4I2C_I2CPU1_POSN                       equ 0005h
RC4I2C_I2CPU1_POSITION                   equ 0005h
RC4I2C_I2CPU1_SIZE                       equ 0001h
RC4I2C_I2CPU1_LENGTH                     equ 0001h
RC4I2C_I2CPU1_MASK                       equ 0020h

// Register: ANSELD
#define ANSELD ANSELD
ANSELD                                   equ 03A70h
// bitfield definitions
ANSELD_ANSELD0_POSN                      equ 0000h
ANSELD_ANSELD0_POSITION                  equ 0000h
ANSELD_ANSELD0_SIZE                      equ 0001h
ANSELD_ANSELD0_LENGTH                    equ 0001h
ANSELD_ANSELD0_MASK                      equ 0001h
ANSELD_ANSELD1_POSN                      equ 0001h
ANSELD_ANSELD1_POSITION                  equ 0001h
ANSELD_ANSELD1_SIZE                      equ 0001h
ANSELD_ANSELD1_LENGTH                    equ 0001h
ANSELD_ANSELD1_MASK                      equ 0002h
ANSELD_ANSELD2_POSN                      equ 0002h
ANSELD_ANSELD2_POSITION                  equ 0002h
ANSELD_ANSELD2_SIZE                      equ 0001h
ANSELD_ANSELD2_LENGTH                    equ 0001h
ANSELD_ANSELD2_MASK                      equ 0004h
ANSELD_ANSELD3_POSN                      equ 0003h
ANSELD_ANSELD3_POSITION                  equ 0003h
ANSELD_ANSELD3_SIZE                      equ 0001h
ANSELD_ANSELD3_LENGTH                    equ 0001h
ANSELD_ANSELD3_MASK                      equ 0008h
ANSELD_ANSELD4_POSN                      equ 0004h
ANSELD_ANSELD4_POSITION                  equ 0004h
ANSELD_ANSELD4_SIZE                      equ 0001h
ANSELD_ANSELD4_LENGTH                    equ 0001h
ANSELD_ANSELD4_MASK                      equ 0010h
ANSELD_ANSELD5_POSN                      equ 0005h
ANSELD_ANSELD5_POSITION                  equ 0005h
ANSELD_ANSELD5_SIZE                      equ 0001h
ANSELD_ANSELD5_LENGTH                    equ 0001h
ANSELD_ANSELD5_MASK                      equ 0020h
ANSELD_ANSELD6_POSN                      equ 0006h
ANSELD_ANSELD6_POSITION                  equ 0006h
ANSELD_ANSELD6_SIZE                      equ 0001h
ANSELD_ANSELD6_LENGTH                    equ 0001h
ANSELD_ANSELD6_MASK                      equ 0040h
ANSELD_ANSELD7_POSN                      equ 0007h
ANSELD_ANSELD7_POSITION                  equ 0007h
ANSELD_ANSELD7_SIZE                      equ 0001h
ANSELD_ANSELD7_LENGTH                    equ 0001h
ANSELD_ANSELD7_MASK                      equ 0080h

// Register: WPUD
#define WPUD WPUD
WPUD                                     equ 03A71h
// bitfield definitions
WPUD_WPUD0_POSN                          equ 0000h
WPUD_WPUD0_POSITION                      equ 0000h
WPUD_WPUD0_SIZE                          equ 0001h
WPUD_WPUD0_LENGTH                        equ 0001h
WPUD_WPUD0_MASK                          equ 0001h
WPUD_WPUD1_POSN                          equ 0001h
WPUD_WPUD1_POSITION                      equ 0001h
WPUD_WPUD1_SIZE                          equ 0001h
WPUD_WPUD1_LENGTH                        equ 0001h
WPUD_WPUD1_MASK                          equ 0002h
WPUD_WPUD2_POSN                          equ 0002h
WPUD_WPUD2_POSITION                      equ 0002h
WPUD_WPUD2_SIZE                          equ 0001h
WPUD_WPUD2_LENGTH                        equ 0001h
WPUD_WPUD2_MASK                          equ 0004h
WPUD_WPUD3_POSN                          equ 0003h
WPUD_WPUD3_POSITION                      equ 0003h
WPUD_WPUD3_SIZE                          equ 0001h
WPUD_WPUD3_LENGTH                        equ 0001h
WPUD_WPUD3_MASK                          equ 0008h
WPUD_WPUD4_POSN                          equ 0004h
WPUD_WPUD4_POSITION                      equ 0004h
WPUD_WPUD4_SIZE                          equ 0001h
WPUD_WPUD4_LENGTH                        equ 0001h
WPUD_WPUD4_MASK                          equ 0010h
WPUD_WPUD5_POSN                          equ 0005h
WPUD_WPUD5_POSITION                      equ 0005h
WPUD_WPUD5_SIZE                          equ 0001h
WPUD_WPUD5_LENGTH                        equ 0001h
WPUD_WPUD5_MASK                          equ 0020h
WPUD_WPUD6_POSN                          equ 0006h
WPUD_WPUD6_POSITION                      equ 0006h
WPUD_WPUD6_SIZE                          equ 0001h
WPUD_WPUD6_LENGTH                        equ 0001h
WPUD_WPUD6_MASK                          equ 0040h
WPUD_WPUD7_POSN                          equ 0007h
WPUD_WPUD7_POSITION                      equ 0007h
WPUD_WPUD7_SIZE                          equ 0001h
WPUD_WPUD7_LENGTH                        equ 0001h
WPUD_WPUD7_MASK                          equ 0080h

