GopalSaraf/Practicals/PSDL/include/proc/pic18lf56k42.inc
// Register: CLCDATA0
#define CLCDATA0 CLCDATA0
CLCDATA0                                 equ 03C7Eh
// bitfield definitions
CLCDATA0_CLC1OUT_POSN                    equ 0000h
CLCDATA0_CLC1OUT_POSITION                equ 0000h
CLCDATA0_CLC1OUT_SIZE                    equ 0001h
CLCDATA0_CLC1OUT_LENGTH                  equ 0001h
CLCDATA0_CLC1OUT_MASK                    equ 0001h
CLCDATA0_CLC2OUT_POSN                    equ 0001h
CLCDATA0_CLC2OUT_POSITION                equ 0001h
CLCDATA0_CLC2OUT_SIZE                    equ 0001h
CLCDATA0_CLC2OUT_LENGTH                  equ 0001h
CLCDATA0_CLC2OUT_MASK                    equ 0002h
CLCDATA0_CLC3OUT_POSN                    equ 0002h
CLCDATA0_CLC3OUT_POSITION                equ 0002h
CLCDATA0_CLC3OUT_SIZE                    equ 0001h
CLCDATA0_CLC3OUT_LENGTH                  equ 0001h
CLCDATA0_CLC3OUT_MASK                    equ 0004h
CLCDATA0_CLC4OUT_POSN                    equ 0003h
CLCDATA0_CLC4OUT_POSITION                equ 0003h
CLCDATA0_CLC4OUT_SIZE                    equ 0001h
CLCDATA0_CLC4OUT_LENGTH                  equ 0001h
CLCDATA0_CLC4OUT_MASK                    equ 0008h

// Register: CLKRCON
#define CLKRCON CLKRCON
CLKRCON                                  equ 03CE5h
// bitfield definitions
CLKRCON_DIV_POSN                         equ 0000h
CLKRCON_DIV_POSITION                     equ 0000h
CLKRCON_DIV_SIZE                         equ 0003h
CLKRCON_DIV_LENGTH                       equ 0003h
CLKRCON_DIV_MASK                         equ 0007h
CLKRCON_DC_POSN                          equ 0003h
CLKRCON_DC_POSITION                      equ 0003h
CLKRCON_DC_SIZE                          equ 0002h
CLKRCON_DC_LENGTH                        equ 0002h
CLKRCON_DC_MASK                          equ 0018h
CLKRCON_EN_POSN                          equ 0007h
CLKRCON_EN_POSITION                      equ 0007h
CLKRCON_EN_SIZE                          equ 0001h
CLKRCON_EN_LENGTH                        equ 0001h
CLKRCON_EN_MASK                          equ 0080h
CLKRCON_CLKRDIV0_POSN                    equ 0000h
CLKRCON_CLKRDIV0_POSITION                equ 0000h
CLKRCON_CLKRDIV0_SIZE                    equ 0001h
CLKRCON_CLKRDIV0_LENGTH                  equ 0001h
CLKRCON_CLKRDIV0_MASK                    equ 0001h
CLKRCON_CLKRDIV1_POSN                    equ 0001h
CLKRCON_CLKRDIV1_POSITION                equ 0001h
CLKRCON_CLKRDIV1_SIZE                    equ 0001h
CLKRCON_CLKRDIV1_LENGTH                  equ 0001h
CLKRCON_CLKRDIV1_MASK                    equ 0002h
CLKRCON_CLKRDIV2_POSN                    equ 0002h
CLKRCON_CLKRDIV2_POSITION                equ 0002h
CLKRCON_CLKRDIV2_SIZE                    equ 0001h
CLKRCON_CLKRDIV2_LENGTH                  equ 0001h
CLKRCON_CLKRDIV2_MASK                    equ 0004h
CLKRCON_CLKRDC0_POSN                     equ 0003h
CLKRCON_CLKRDC0_POSITION                 equ 0003h
CLKRCON_CLKRDC0_SIZE                     equ 0001h
CLKRCON_CLKRDC0_LENGTH                   equ 0001h
CLKRCON_CLKRDC0_MASK                     equ 0008h
CLKRCON_CLKRDC1_POSN                     equ 0004h
CLKRCON_CLKRDC1_POSITION                 equ 0004h
CLKRCON_CLKRDC1_SIZE                     equ 0001h
CLKRCON_CLKRDC1_LENGTH                   equ 0001h
CLKRCON_CLKRDC1_MASK                     equ 0010h
CLKRCON_CLKREN_POSN                      equ 0007h
CLKRCON_CLKREN_POSITION                  equ 0007h
CLKRCON_CLKREN_SIZE                      equ 0001h
CLKRCON_CLKREN_LENGTH                    equ 0001h
CLKRCON_CLKREN_MASK                      equ 0080h
CLKRCON_CLKRDIV_POSN                     equ 0000h
CLKRCON_CLKRDIV_POSITION                 equ 0000h
CLKRCON_CLKRDIV_SIZE                     equ 0003h
CLKRCON_CLKRDIV_LENGTH                   equ 0003h
CLKRCON_CLKRDIV_MASK                     equ 0007h
CLKRCON_CLKRDC_POSN                      equ 0003h
CLKRCON_CLKRDC_POSITION                  equ 0003h
CLKRCON_CLKRDC_SIZE                      equ 0002h
CLKRCON_CLKRDC_LENGTH                    equ 0002h
CLKRCON_CLKRDC_MASK                      equ 0018h

// Register: CLKRCLK
#define CLKRCLK CLKRCLK
CLKRCLK                                  equ 03CE6h
// bitfield definitions
CLKRCLK_CLK_POSN                         equ 0000h
CLKRCLK_CLK_POSITION                     equ 0000h
CLKRCLK_CLK_SIZE                         equ 0004h
CLKRCLK_CLK_LENGTH                       equ 0004h
CLKRCLK_CLK_MASK                         equ 000Fh
CLKRCLK_CLKRCLK_POSN                     equ 0000h
CLKRCLK_CLKRCLK_POSITION                 equ 0000h
CLKRCLK_CLKRCLK_SIZE                     equ 0004h
CLKRCLK_CLKRCLK_LENGTH                   equ 0004h
CLKRCLK_CLKRCLK_MASK                     equ 000Fh
CLKRCLK_CLK0_POSN                        equ 0000h
CLKRCLK_CLK0_POSITION                    equ 0000h
CLKRCLK_CLK0_SIZE                        equ 0001h
CLKRCLK_CLK0_LENGTH                      equ 0001h
CLKRCLK_CLK0_MASK                        equ 0001h
CLKRCLK_CLK1_POSN                        equ 0001h
CLKRCLK_CLK1_POSITION                    equ 0001h
CLKRCLK_CLK1_SIZE                        equ 0001h
CLKRCLK_CLK1_LENGTH                      equ 0001h
CLKRCLK_CLK1_MASK                        equ 0002h
CLKRCLK_CLK2_POSN                        equ 0002h
CLKRCLK_CLK2_POSITION                    equ 0002h
CLKRCLK_CLK2_SIZE                        equ 0001h
CLKRCLK_CLK2_LENGTH                      equ 0001h
CLKRCLK_CLK2_MASK                        equ 0004h
CLKRCLK_CLK3_POSN                        equ 0003h
CLKRCLK_CLK3_POSITION                    equ 0003h
CLKRCLK_CLK3_SIZE                        equ 0001h
CLKRCLK_CLK3_LENGTH                      equ 0001h
CLKRCLK_CLK3_MASK                        equ 0008h
CLKRCLK_CLKRCLK0_POSN                    equ 0000h
CLKRCLK_CLKRCLK0_POSITION                equ 0000h
CLKRCLK_CLKRCLK0_SIZE                    equ 0001h
CLKRCLK_CLKRCLK0_LENGTH                  equ 0001h
CLKRCLK_CLKRCLK0_MASK                    equ 0001h
CLKRCLK_CLKRCLK1_POSN                    equ 0001h
CLKRCLK_CLKRCLK1_POSITION                equ 0001h
CLKRCLK_CLKRCLK1_SIZE                    equ 0001h
CLKRCLK_CLKRCLK1_LENGTH                  equ 0001h
CLKRCLK_CLKRCLK1_MASK                    equ 0002h
CLKRCLK_CLKRCLK2_POSN                    equ 0002h
CLKRCLK_CLKRCLK2_POSITION                equ 0002h
CLKRCLK_CLKRCLK2_SIZE                    equ 0001h
CLKRCLK_CLKRCLK2_LENGTH                  equ 0001h
CLKRCLK_CLKRCLK2_MASK                    equ 0004h
CLKRCLK_CLKRCLK3_POSN                    equ 0003h
CLKRCLK_CLKRCLK3_POSITION                equ 0003h
CLKRCLK_CLKRCLK3_SIZE                    equ 0001h
CLKRCLK_CLKRCLK3_LENGTH                  equ 0001h
CLKRCLK_CLKRCLK3_MASK                    equ 0008h

// Register: MD1CON0
#define MD1CON0 MD1CON0
MD1CON0                                  equ 03CFAh
// bitfield definitions
MD1CON0_BIT_POSN                         equ 0000h
MD1CON0_BIT_POSITION                     equ 0000h
MD1CON0_BIT_SIZE                         equ 0001h
MD1CON0_BIT_LENGTH                       equ 0001h
MD1CON0_BIT_MASK                         equ 0001h
MD1CON0_OPOL_POSN                        equ 0004h
MD1CON0_OPOL_POSITION                    equ 0004h
MD1CON0_OPOL_SIZE                        equ 0001h
MD1CON0_OPOL_LENGTH                      equ 0001h
MD1CON0_OPOL_MASK                        equ 0010h
MD1CON0_OUT_POSN                         equ 0005h
MD1CON0_OUT_POSITION                     equ 0005h
MD1CON0_OUT_SIZE                         equ 0001h
MD1CON0_OUT_LENGTH                       equ 0001h
MD1CON0_OUT_MASK                         equ 0020h
MD1CON0_EN_POSN                          equ 0007h
MD1CON0_EN_POSITION                      equ 0007h
MD1CON0_EN_SIZE                          equ 0001h
MD1CON0_EN_LENGTH                        equ 0001h
MD1CON0_EN_MASK                          equ 0080h
MD1CON0_MD1BIT_POSN                      equ 0000h
MD1CON0_MD1BIT_POSITION                  equ 0000h
MD1CON0_MD1BIT_SIZE                      equ 0001h
MD1CON0_MD1BIT_LENGTH                    equ 0001h
MD1CON0_MD1BIT_MASK                      equ 0001h
MD1CON0_MD1OPOL_POSN                     equ 0004h
MD1CON0_MD1OPOL_POSITION                 equ 0004h
MD1CON0_MD1OPOL_SIZE                     equ 0001h
MD1CON0_MD1OPOL_LENGTH                   equ 0001h
MD1CON0_MD1OPOL_MASK                     equ 0010h
MD1CON0_MD1OUT_POSN                      equ 0005h
MD1CON0_MD1OUT_POSITION                  equ 0005h
MD1CON0_MD1OUT_SIZE                      equ 0001h
MD1CON0_MD1OUT_LENGTH                    equ 0001h
MD1CON0_MD1OUT_MASK                      equ 0020h
MD1CON0_MD1EN_POSN                       equ 0007h
MD1CON0_MD1EN_POSITION                   equ 0007h
MD1CON0_MD1EN_SIZE                       equ 0001h
MD1CON0_MD1EN_LENGTH                     equ 0001h
MD1CON0_MD1EN_MASK                       equ 0080h

