GopalSaraf/Practicals/PSDL/include/proc/pic18lf56k42.inc
#define TMR4                             BANKMASK(SMT1TMRL), 4, b
#define TMR4IE                           BANKMASK(PIE7), 0, b
#define TMR4IF                           BANKMASK(PIR7), 0, b
#define TMR4IP                           BANKMASK(IPR7), 0, b
#define TMR4MD                           BANKMASK(PMD1), 4, b
#define TMR4ON                           BANKMASK(T4CON), 7, a
#define TMR5                             BANKMASK(SMT1TMRL), 5, b
#define TMR5GIE                          BANKMASK(PIE8), 7, b
#define TMR5GIF                          BANKMASK(PIR8), 7, b
#define TMR5GIP                          BANKMASK(IPR8), 7, b
#define TMR5H0                           BANKMASK(TMR5H), 0, a
#define TMR5H1                           BANKMASK(TMR5H), 1, a
#define TMR5H2                           BANKMASK(TMR5H), 2, a
#define TMR5H3                           BANKMASK(TMR5H), 3, a
#define TMR5H4                           BANKMASK(TMR5H), 4, a
#define TMR5H5                           BANKMASK(TMR5H), 5, a
#define TMR5H6                           BANKMASK(TMR5H), 6, a
#define TMR5H7                           BANKMASK(TMR5H), 7, a
#define TMR5IE                           BANKMASK(PIE8), 6, b
#define TMR5IF                           BANKMASK(PIR8), 6, b
#define TMR5IP                           BANKMASK(IPR8), 6, b
#define TMR5L0                           BANKMASK(TMR5L), 0, a
#define TMR5L1                           BANKMASK(TMR5L), 1, a
#define TMR5L2                           BANKMASK(TMR5L), 2, a
#define TMR5L3                           BANKMASK(TMR5L), 3, a
#define TMR5L4                           BANKMASK(TMR5L), 4, a
#define TMR5L5                           BANKMASK(TMR5L), 5, a
#define TMR5L6                           BANKMASK(TMR5L), 6, a
#define TMR5L7                           BANKMASK(TMR5L), 7, a
#define TMR5MD                           BANKMASK(PMD1), 5, b
#define TMR5ON                           BANKMASK(T5CON), 0, a
#define TMR6                             BANKMASK(SMT1TMRL), 6, b
#define TMR6IE                           BANKMASK(PIE9), 0, b
#define TMR6IF                           BANKMASK(PIR9), 0, b
#define TMR6IP                           BANKMASK(IPR9), 0, b
#define TMR6MD                           BANKMASK(PMD1), 6, b
#define TMR6ON                           BANKMASK(T6CON), 7, a
#define TMR7                             BANKMASK(SMT1TMRL), 7, b
#define TMR8                             BANKMASK(SMT1TMRH), 0, b
#define TMR9                             BANKMASK(SMT1TMRH), 1, b
#define TRIGEN                           BANKMASK(SCANCON0), 6, b
#define TRISA0                           BANKMASK(TRISA), 0, a
#define TRISA1                           BANKMASK(TRISA), 1, a
#define TRISA2                           BANKMASK(TRISA), 2, a
#define TRISA3                           BANKMASK(TRISA), 3, a
#define TRISA4                           BANKMASK(TRISA), 4, a
#define TRISA5                           BANKMASK(TRISA), 5, a
#define TRISA6                           BANKMASK(TRISA), 6, a
#define TRISA7                           BANKMASK(TRISA), 7, a
#define TRISB0                           BANKMASK(TRISB), 0, a
#define TRISB1                           BANKMASK(TRISB), 1, a
#define TRISB2                           BANKMASK(TRISB), 2, a
#define TRISB3                           BANKMASK(TRISB), 3, a
#define TRISB4                           BANKMASK(TRISB), 4, a
#define TRISB5                           BANKMASK(TRISB), 5, a
#define TRISB6                           BANKMASK(TRISB), 6, a
#define TRISB7                           BANKMASK(TRISB), 7, a
#define TRISC0                           BANKMASK(TRISC), 0, a
#define TRISC1                           BANKMASK(TRISC), 1, a
#define TRISC2                           BANKMASK(TRISC), 2, a
#define TRISC3                           BANKMASK(TRISC), 3, a
#define TRISC4                           BANKMASK(TRISC), 4, a
#define TRISC5                           BANKMASK(TRISC), 5, a
#define TRISC6                           BANKMASK(TRISC), 6, a
#define TRISC7                           BANKMASK(TRISC), 7, a
#define TRISD0                           BANKMASK(TRISD), 0, a
#define TRISD1                           BANKMASK(TRISD), 1, a
#define TRISD2                           BANKMASK(TRISD), 2, a
#define TRISD3                           BANKMASK(TRISD), 3, a
#define TRISD4                           BANKMASK(TRISD), 4, a
#define TRISD5                           BANKMASK(TRISD), 5, a
#define TRISD6                           BANKMASK(TRISD), 6, a
#define TRISD7                           BANKMASK(TRISD), 7, a
#define TRISE0                           BANKMASK(TRISE), 0, a
#define TRISE1                           BANKMASK(TRISE), 1, a
#define TRISE2                           BANKMASK(TRISE), 2, a
#define TRISF0                           BANKMASK(TRISF), 0, a
#define TRISF1                           BANKMASK(TRISF), 1, a
#define TRISF2                           BANKMASK(TRISF), 2, a
#define TRISF3                           BANKMASK(TRISF), 3, a
#define TRISF4                           BANKMASK(TRISF), 4, a
#define TRISF5                           BANKMASK(TRISF), 5, a
#define TRISF6                           BANKMASK(TRISF), 6, a
#define TRISF7                           BANKMASK(TRISF), 7, a
#define TS                               BANKMASK(SMT1STAT), 2, b
#define TSEN                             BANKMASK(FVRCON), 5, b
#define TSRNG                            BANKMASK(FVRCON), 4, b
#define TUN0                             BANKMASK(OSCTUNE), 0, b
#define TUN1                             BANKMASK(OSCTUNE), 1, b
#define TUN2                             BANKMASK(OSCTUNE), 2, b
#define TUN3                             BANKMASK(OSCTUNE), 3, b
#define TUN4                             BANKMASK(OSCTUNE), 4, b
#define TUN5                             BANKMASK(OSCTUNE), 5, b
#define TWIDTH0                          BANKMASK(SPI1TWIDTH), 0, b
#define TWIDTH1                          BANKMASK(SPI1TWIDTH), 1, b
#define TWIDTH2                          BANKMASK(SPI1TWIDTH), 2, b
#define TXB0                             BANKMASK(SPI1TXB), 0, b
#define TXB1                             BANKMASK(SPI1TXB), 1, b
#define TXB2                             BANKMASK(SPI1TXB), 2, b
#define TXB3                             BANKMASK(SPI1TXB), 3, b
#define TXB4                             BANKMASK(SPI1TXB), 4, b
#define TXB5                             BANKMASK(SPI1TXB), 5, b
#define TXB6                             BANKMASK(SPI1TXB), 6, b
#define TXB7                             BANKMASK(SPI1TXB), 7, b
#define TXR                              BANKMASK(SPI1CON2), 1, b
#define TXUIE                            BANKMASK(SPI1INTE), 1, b
#define TXUIF                            BANKMASK(SPI1INTF), 1, b
#define U1ABDEN                          BANKMASK(U1CON0), 6, b
#define U1ABDIE                          BANKMASK(U1UIR), 2, b
#define U1ABDIF                          BANKMASK(U1UIR), 6, b
#define U1ABDOVE                         BANKMASK(U1ERRIE), 5, b
#define U1ABDOVF                         BANKMASK(U1ERRIR), 5, b
#define U1BRGS                           BANKMASK(U1CON0), 7, b
#define U1BRKOVR                         BANKMASK(U1CON1), 1, b
#define U1C0EN                           BANKMASK(U1CON2), 3, b
#define U1CERIE                          BANKMASK(U1ERRIE), 4, b
#define U1CERIF                          BANKMASK(U1ERRIR), 4, b
#define U1EIE                            BANKMASK(PIE3), 5, b
#define U1EIF                            BANKMASK(PIR3), 5, b
#define U1EIP                            BANKMASK(IPR3), 5, b
#define U1FERIE                          BANKMASK(U1ERRIE), 3, b
#define U1FERIF                          BANKMASK(U1ERRIR), 3, b
#define U1FLO0                           BANKMASK(U1CON2), 0, b
#define U1FLO1                           BANKMASK(U1CON2), 1, b
#define U1IE                             BANKMASK(PIE3), 6, b
#define U1IF                             BANKMASK(PIR3), 6, b
#define U1IP                             BANKMASK(IPR3), 6, b
#define U1MD                             BANKMASK(PMD5), 4, b
#define U1MODE0                          BANKMASK(U1CON0), 0, b
#define U1MODE1                          BANKMASK(U1CON0), 1, b
#define U1MODE2                          BANKMASK(U1CON0), 2, b
#define U1MODE3                          BANKMASK(U1CON0), 3, b
#define U1ON                             BANKMASK(U1CON1), 7, b
#define U1PERIE                          BANKMASK(U1ERRIE), 6, b
#define U1PERIF                          BANKMASK(U1ERRIR), 6, b
#define U1RCIDL                          BANKMASK(U1FIFO), 3, b
#define U1RUNOVF                         BANKMASK(U1CON2), 7, b
#define U1RXBE                           BANKMASK(U1FIFO), 1, b
#define U1RXBF                           BANKMASK(U1FIFO), 0, b
#define U1RXBIMD                         BANKMASK(U1CON1), 3, b
#define U1RXBKIE                         BANKMASK(U1ERRIE), 2, b
#define U1RXBKIF                         BANKMASK(U1ERRIR), 2, b
#define U1RXEN                           BANKMASK(U1CON0), 4, b
#define U1RXFOIE                         BANKMASK(U1ERRIE), 1, b
#define U1RXFOIF                         BANKMASK(U1ERRIR), 1, b
#define U1RXIDL                          BANKMASK(U1FIFO), 3, b
#define U1RXIE                           BANKMASK(PIE3), 3, b
#define U1RXIF                           BANKMASK(PIR3), 3, b
#define U1RXIP                           BANKMASK(IPR3), 3, b
#define U1RXPOL                          BANKMASK(U1CON2), 6, b
#define U1SENDB                          BANKMASK(U1CON1), 0, b
#define U1STP0                           BANKMASK(U1CON2), 4, b
#define U1STP1                           BANKMASK(U1CON2), 5, b
#define U1STPMD                          BANKMASK(U1FIFO), 6, b
#define U1TXBE                           BANKMASK(U1FIFO), 5, b
#define U1TXBF                           BANKMASK(U1FIFO), 4, b
#define U1TXCIE                          BANKMASK(U1ERRIE), 0, b
#define U1TXCIF                          BANKMASK(U1ERRIR), 0, b
#define U1TXEN                           BANKMASK(U1CON0), 5, b
#define U1TXIE                           BANKMASK(PIE3), 4, b
#define U1TXIF                           BANKMASK(PIR3), 4, b
#define U1TXIP                           BANKMASK(IPR3), 4, b
#define U1TXMTIE                         BANKMASK(U1ERRIE), 7, b
#define U1TXMTIF                         BANKMASK(U1ERRIR), 7, b
#define U1TXPOL                          BANKMASK(U1CON2), 2, b
#define U1TXWRE                          BANKMASK(U1FIFO), 7, b
#define U1WUE                            BANKMASK(U1CON1), 4, b
#define U1WUIF                           BANKMASK(U1UIR), 7, b
#define U1XON                            BANKMASK(U1FIFO), 2, b
#define U2ABDEN                          BANKMASK(U2CON0), 6, b
#define U2ABDIE                          BANKMASK(U2UIR), 2, b
#define U2ABDIF                          BANKMASK(U2UIR), 6, b
#define U2ABDOVE                         BANKMASK(U2ERRIE), 5, b
#define U2ABDOVF                         BANKMASK(U2ERRIR), 5, b
#define U2BRGS                           BANKMASK(U2CON0), 7, b
#define U2BRKOVR                         BANKMASK(U2CON1), 1, b
#define U2CERIE                          BANKMASK(U2ERRIE), 4, b
#define U2CERIF                          BANKMASK(U2ERRIR), 4, b
#define U2EIE                            BANKMASK(PIE6), 4, b
#define U2EIF                            BANKMASK(PIR6), 4, b
#define U2EIP                            BANKMASK(IPR6), 4, b
#define U2FERIE                          BANKMASK(U2ERRIE), 3, b
#define U2FERIF                          BANKMASK(U2ERRIR), 3, b
#define U2FLO0                           BANKMASK(U2CON2), 0, b
#define U2FLO1                           BANKMASK(U2CON2), 1, b
#define U2IE                             BANKMASK(PIE6), 5, b
#define U2IF                             BANKMASK(PIR6), 5, b
#define U2IP                             BANKMASK(IPR6), 5, b
#define U2MD                             BANKMASK(PMD5), 5, b
#define U2MODE0                          BANKMASK(U2CON0), 0, b
#define U2MODE1                          BANKMASK(U2CON0), 1, b
#define U2MODE2                          BANKMASK(U2CON0), 2, b
#define U2ON                             BANKMASK(U2CON1), 7, b
#define U2PERIE                          BANKMASK(U2ERRIE), 6, b
#define U2PERIF                          BANKMASK(U2ERRIR), 6, b
#define U2RCIDL                          BANKMASK(U2FIFO), 3, b
#define U2RUNOVF                         BANKMASK(U2CON2), 7, b
#define U2RXBE                           BANKMASK(U2FIFO), 1, b
#define U2RXBF                           BANKMASK(U2FIFO), 0, b
#define U2RXBIMD                         BANKMASK(U2CON1), 3, b
#define U2RXBKIE                         BANKMASK(U2ERRIE), 2, b
#define U2RXBKIF                         BANKMASK(U2ERRIR), 2, b
#define U2RXEN                           BANKMASK(U2CON0), 4, b
#define U2RXFOIE                         BANKMASK(U2ERRIE), 1, b
#define U2RXFOIF                         BANKMASK(U2ERRIR), 1, b
#define U2RXIDL                          BANKMASK(U2FIFO), 3, b
#define U2RXIE                           BANKMASK(PIE6), 2, b
#define U2RXIF                           BANKMASK(PIR6), 2, b
#define U2RXIP                           BANKMASK(IPR6), 2, b
#define U2RXPOL                          BANKMASK(U2CON2), 6, b
#define U2SENDB                          BANKMASK(U2CON1), 0, b
#define U2STP0                           BANKMASK(U2CON2), 4, b
#define U2STP1                           BANKMASK(U2CON2), 5, b
#define U2STPMD                          BANKMASK(U2FIFO), 6, b
#define U2TXBE                           BANKMASK(U2FIFO), 5, b
#define U2TXBF                           BANKMASK(U2FIFO), 4, b
#define U2TXCIE                          BANKMASK(U2ERRIE), 0, b
#define U2TXCIF                          BANKMASK(U2ERRIR), 0, b
#define U2TXEN                           BANKMASK(U2CON0), 5, b
#define U2TXIE                           BANKMASK(PIE6), 3, b
#define U2TXIF                           BANKMASK(PIR6), 3, b
#define U2TXIP                           BANKMASK(IPR6), 3, b
#define U2TXMTIE                         BANKMASK(U2ERRIE), 7, b
#define U2TXMTIF                         BANKMASK(U2ERRIR), 7, b
#define U2TXPOL                          BANKMASK(U2CON2), 2, b
#define U2TXWRE                          BANKMASK(U2FIFO), 7, b
#define U2WUE                            BANKMASK(U2CON1), 4, b
#define U2WUIF                           BANKMASK(U2UIR), 7, b
#define U2XON                            BANKMASK(U2FIFO), 2, b
#define UTH0                             BANKMASK(ADUTHL), 0, b
#define UTH1                             BANKMASK(ADUTHL), 1, b
#define UTH10                            BANKMASK(ADUTHH), 2, b
#define UTH11                            BANKMASK(ADUTHH), 3, b
#define UTH12                            BANKMASK(ADUTHH), 4, b
#define UTH13                            BANKMASK(ADUTHH), 5, b
#define UTH14                            BANKMASK(ADUTHH), 6, b
#define UTH15                            BANKMASK(ADUTHH), 7, b
#define UTH2                             BANKMASK(ADUTHL), 2, b
#define UTH3                             BANKMASK(ADUTHL), 3, b
#define UTH4                             BANKMASK(ADUTHL), 4, b
#define UTH5                             BANKMASK(ADUTHL), 5, b
#define UTH6                             BANKMASK(ADUTHL), 6, b
#define UTH7                             BANKMASK(ADUTHL), 7, b
#define UTH8                             BANKMASK(ADUTHH), 0, b
#define UTH9                             BANKMASK(ADUTHH), 1, b
#define UTHR                             BANKMASK(ADSTAT), 6, b
#define WDTCS0                           BANKMASK(WDTCON1), 4, b
#define WDTCS1                           BANKMASK(WDTCON1), 5, b
#define WDTCS2                           BANKMASK(WDTCON1), 6, b
#define WDTPS0                           BANKMASK(WDTCON0), 1, b
#define WDTPS1                           BANKMASK(WDTCON0), 2, b
#define WDTPS2                           BANKMASK(WDTCON0), 3, b
#define WDTPS3                           BANKMASK(WDTCON0), 4, b
#define WDTPS4                           BANKMASK(WDTCON0), 5, b
#define WDTPSCNT0                        BANKMASK(WDTPSL), 0, b
#define WDTPSCNT1                        BANKMASK(WDTPSL), 1, b
#define WDTPSCNT10                       BANKMASK(WDTPSH), 2, b
#define WDTPSCNT11                       BANKMASK(WDTPSH), 3, b
#define WDTPSCNT12                       BANKMASK(WDTPSH), 4, b
#define WDTPSCNT13                       BANKMASK(WDTPSH), 5, b
#define WDTPSCNT14                       BANKMASK(WDTPSH), 6, b
#define WDTPSCNT15                       BANKMASK(WDTPSH), 7, b
#define WDTPSCNT16                       BANKMASK(WDTTMR), 0, b
#define WDTPSCNT17                       BANKMASK(WDTTMR), 1, b
#define WDTPSCNT2                        BANKMASK(WDTPSL), 2, b
#define WDTPSCNT3                        BANKMASK(WDTPSL), 3, b
#define WDTPSCNT4                        BANKMASK(WDTPSL), 4, b
#define WDTPSCNT5                        BANKMASK(WDTPSL), 5, b
#define WDTPSCNT6                        BANKMASK(WDTPSL), 6, b
#define WDTPSCNT7                        BANKMASK(WDTPSL), 7, b
#define WDTPSCNT8                        BANKMASK(WDTPSH), 0, b
#define WDTPSCNT9                        BANKMASK(WDTPSH), 1, b
#define WDTSEN                           BANKMASK(WDTCON0), 0, b
#define WDTSTATE                         BANKMASK(WDTTMR), 2, b
#define WDTTMR0                          BANKMASK(WDTTMR), 3, b
#define WDTTMR1                          BANKMASK(WDTTMR), 4, b
#define WDTTMR2                          BANKMASK(WDTTMR), 5, b
#define WDTTMR3                          BANKMASK(WDTTMR), 6, b
#define WDTTMR4                          BANKMASK(WDTTMR), 7, b
#define WDTWINDOW0                       BANKMASK(WDTCON1), 0, b
#define WDTWINDOW1                       BANKMASK(WDTCON1), 1, b
#define WDTWINDOW2                       BANKMASK(WDTCON1), 2, b
#define WDTWV                            BANKMASK(PCON0), 5, a
#define WINDOW0                          BANKMASK(WDTCON1), 0, b
#define WINDOW1                          BANKMASK(WDTCON1), 1, b
#define WINDOW2                          BANKMASK(WDTCON1), 2, b
#define WPOL                             BANKMASK(SMT1CON0), 4, b
#define WPUA0                            BANKMASK(WPUA), 0, b
#define WPUA1                            BANKMASK(WPUA), 1, b
#define WPUA2                            BANKMASK(WPUA), 2, b
#define WPUA3                            BANKMASK(WPUA), 3, b
#define WPUA4                            BANKMASK(WPUA), 4, b
#define WPUA5                            BANKMASK(WPUA), 5, b
#define WPUA6                            BANKMASK(WPUA), 6, b
#define WPUA7                            BANKMASK(WPUA), 7, b
#define WPUB0                            BANKMASK(WPUB), 0, b
#define WPUB1                            BANKMASK(WPUB), 1, b
#define WPUB2                            BANKMASK(WPUB), 2, b
#define WPUB3                            BANKMASK(WPUB), 3, b
#define WPUB4                            BANKMASK(WPUB), 4, b
#define WPUB5                            BANKMASK(WPUB), 5, b
#define WPUB6                            BANKMASK(WPUB), 6, b
#define WPUB7                            BANKMASK(WPUB), 7, b
#define WPUC0                            BANKMASK(WPUC), 0, b
#define WPUC1                            BANKMASK(WPUC), 1, b
#define WPUC2                            BANKMASK(WPUC), 2, b
#define WPUC3                            BANKMASK(WPUC), 3, b
#define WPUC4                            BANKMASK(WPUC), 4, b
#define WPUC5                            BANKMASK(WPUC), 5, b
#define WPUC6                            BANKMASK(WPUC), 6, b
#define WPUC7                            BANKMASK(WPUC), 7, b
#define WPUD0                            BANKMASK(WPUD), 0, b
#define WPUD1                            BANKMASK(WPUD), 1, b
#define WPUD2                            BANKMASK(WPUD), 2, b
#define WPUD3                            BANKMASK(WPUD), 3, b
#define WPUD4                            BANKMASK(WPUD), 4, b
#define WPUD5                            BANKMASK(WPUD), 5, b
#define WPUD6                            BANKMASK(WPUD), 6, b
#define WPUD7                            BANKMASK(WPUD), 7, b
#define WPUE0                            BANKMASK(WPUE), 0, b
#define WPUE1                            BANKMASK(WPUE), 1, b
#define WPUE2                            BANKMASK(WPUE), 2, b
#define WPUE3                            BANKMASK(WPUE), 3, b
#define WPUF0                            BANKMASK(WPUF), 0, b
#define WPUF1                            BANKMASK(WPUF), 1, b
#define WPUF2                            BANKMASK(WPUF), 2, b
#define WPUF3                            BANKMASK(WPUF), 3, b
#define WPUF4                            BANKMASK(WPUF), 4, b
#define WPUF5                            BANKMASK(WPUF), 5, b
#define WPUF6                            BANKMASK(WPUF), 6, b
#define WPUF7                            BANKMASK(WPUF), 7, b
#define WR                               BANKMASK(NVMCON1), 1, b
#define WR1IE                            BANKMASK(I2C1PIE), 4, b
#define WR1IF                            BANKMASK(I2C1PIR), 4, b
#define WR2IE                            BANKMASK(I2C2PIE), 4, b
#define WR2IF                            BANKMASK(I2C2PIR), 4, b
#define WREN                             BANKMASK(NVMCON1), 2, b
#define WRERR                            BANKMASK(NVMCON1), 3, b
#define WS                               BANKMASK(SMT1STAT), 1, b
#define WSEL0                            BANKMASK(SMT1WIN), 0, b
#define WSEL1                            BANKMASK(SMT1WIN), 1, b
#define WSEL2                            BANKMASK(SMT1WIN), 2, b
#define WSEL3                            BANKMASK(SMT1WIN), 3, b
#define WSEL4                            BANKMASK(SMT1WIN), 4, b
#define X1                               BANKMASK(CRCXORL), 1, b
#define X10                              BANKMASK(CRCXORH), 2, b
#define X11                              BANKMASK(CRCXORH), 3, b
#define X12                              BANKMASK(CRCXORH), 4, b
#define X13                              BANKMASK(CRCXORH), 5, b
#define X14                              BANKMASK(CRCXORH), 6, b
#define X15                              BANKMASK(CRCXORH), 7, b
#define X2                               BANKMASK(CRCXORL), 2, b
#define X3                               BANKMASK(CRCXORL), 3, b
#define X4                               BANKMASK(CRCXORL), 4, b
#define X5                               BANKMASK(CRCXORL), 5, b
#define X6                               BANKMASK(CRCXORL), 6, b
#define X7                               BANKMASK(CRCXORL), 7, b
#define X8                               BANKMASK(CRCXORH), 0, b
#define X9                               BANKMASK(CRCXORH), 1, b
#define ZCDIE                            BANKMASK(PIE1), 1, b
#define ZCDIF                            BANKMASK(PIR1), 1, b
#define ZCDINTN                          BANKMASK(ZCDCON), 0, b
#define ZCDINTP                          BANKMASK(ZCDCON), 1, b
#define ZCDIP                            BANKMASK(IPR1), 1, b
#define ZCDMD                            BANKMASK(PMD2), 0, b
#define ZCDOUT                           BANKMASK(ZCDCON), 5, b
#define ZCDPOL                           BANKMASK(ZCDCON), 4, b
#define ZCDSEN                           BANKMASK(ZCDCON), 7, b
#define ZERO                             BANKMASK(STATUS), 2, a
#define nBOR                             BANKMASK(PCON0), 0, a
#define nMEMV                            BANKMASK(PCON1), 1, a
#define nPOR                             BANKMASK(PCON0), 1, a
#define nRI                              BANKMASK(PCON0), 2, a
#define nRMCLR                           BANKMASK(PCON0), 3, a
#define nRWDT                            BANKMASK(PCON0), 4, a
#define nWDTWV                           BANKMASK(PCON0), 5, a

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

#if _COMMON_SIZE_
psect udata_acs,class=COMRAM,space=SPACE_DATA,noexec,lowdata
#endif
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec,lowdata
psect udata_bank1,class=BANK1,space=SPACE_DATA,noexec,lowdata
psect udata_bank2,class=BANK2,space=SPACE_DATA,noexec,lowdata
psect udata_bank3,class=BANK3,space=SPACE_DATA,noexec,lowdata
psect udata_bank4,class=BANK4,space=SPACE_DATA,noexec,lowdata
psect udata_bank5,class=BANK5,space=SPACE_DATA,noexec,lowdata
psect udata_bank6,class=BANK6,space=SPACE_DATA,noexec,lowdata
psect udata_bank7,class=BANK7,space=SPACE_DATA,noexec,lowdata
psect udata_bank8,class=BANK8,space=SPACE_DATA,noexec,lowdata
psect udata_bank9,class=BANK9,space=SPACE_DATA,noexec,lowdata
psect udata_bank10,class=BANK10,space=SPACE_DATA,noexec,lowdata
psect udata_bank11,class=BANK11,space=SPACE_DATA,noexec,lowdata
psect udata_bank12,class=BANK12,space=SPACE_DATA,noexec,lowdata
psect udata_bank13,class=BANK13,space=SPACE_DATA,noexec,lowdata
psect udata_bank14,class=BANK14,space=SPACE_DATA,noexec,lowdata
psect udata_bank15,class=BANK15,space=SPACE_DATA,noexec,lowdata
psect udata,class=RAM,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,reloc=2
psect data,class=CONST,space=SPACE_CODE,reloc=2,noexec
psect edata,class=EEDATA,space=SPACE_EEPROM,delta=1,noexec

#endif // _XC_INC_

#endif // _PIC18LF56K42_INC_
